export const NamePool = {
  familyNames: ['김', '정', '박', '최', '권', '정', '박', '최', '권', '강', '윤', '신', '하'],
  lastNames: ['영우', '수연', '민우', '명석', '영훈', '현진', '수재', '신웅', '율', '민우', '나라', '지수', '정연', '하은', '석윤'],
}

export const EmailPool = {
  emailFirst: ['orca', 'copy_cat', 'big_mountain', 'happy_dog', 'poodle', 'black_bird', 'ocean', 'dolphin', 'love_animal', 'sit_down'],
  emailDomains: ['gmail.com', 'naver.com', 'daum.net', 'postech.ac.kr', 'snu.ac.kr'],
}

export const PetPool = {
  names: ['가로', '떼껄룩', '몽이', '루비', '몽실이', '세로', '노벨이', '아벨이'],
  breeds: ['푸들', '시츄', '진돗개', '불독', '불명', '페르시안', '메인쿤', '스핑스크'],
  descriptions: ['온순하고 사람을 잘 따릅니다', '활발하고 돌아다니길 좋아합니다', '중성화 수술을 받았습니다', '지병이 있습니다', '백내장이 있습니다.']
}

export const VetPool = {
  fields: ['중성화', '노령견', '내시경', '외과', '한방 재활', '24시 응급', '만성 장병증', '호흡기', '순환기', '소화기', '비교기', '내분기과', '안과', '치과', '종양', '산과', '예방의학'],
  locationStarts: [
    '건강',
    '잠실',
    '행복',
    '반려',
    '견공',
  ],
  locationLasts: [
    '동물병원',
    '동물센터',
  ],
  descriptions: [
    '노령견/묘에게 건강은 삶의 질이다.',
    '고양이는 강아지 와는 다르다는 의미를 정확히 이해한 병원은 많지 않습니다.',
    '국내 최고 수의사 & 행동전문가, 믿고 맡겨주세요.',
    '성심성의껏 상담해드리겠습니다.',
    '안녕하세요. 친절하고 정확하게 봐드립니다.',
  ],
}

export const TrainerPool = {
  locationStarts: [
    '보듬',
    '사랑',
    '레인보우',
    '멍냥',
    '명랑',
    '행복',
    '나루'
  ],
  locationLasts: [
    '컴퍼니',
    '유치원',
    '돌봄',
    '교육',
  ],
  fields: [
    '소형견',
    '중형견',
    '대형견',
    '소형묘',
    '대형묘',
    '분리불안',
    '산책 교육',
    '배변 훈련',
    '짖음',
    '사회성 부족',
    '식단',
    '다이어트'
  ],
  descriptions: [
    '사랑으로 가르치는 반려동물 행동양식',
    '댕댕이는 사랑입니다.',
    '저 강형욱입니다.',
    '세상에 나쁜 개는 없다',
  ],
}

export const QuestionPool = {
  titleAndContents: [
    {
      title: '5세 여아 말티즈(중성화X), 슬개골 탈구된 것 같아요',
      content: '어제 산책을 하다가 발을 잘못 비뎠는지 계속 아파하네요 ㅠㅠ 어떻게 해야 할까요 ㅠㅠㅠㅠㅠ',
    },
    {
      title: '강아지가 매트에서 미끄러져도 슬개골 탈구가 될 수 있나요?',
      content: '오늘 저희집 초코가 매트에서 미끄러졌는데 오후 내내 아파하고 있네요 ㅠㅠ 슬개골 탈구인 걸까요?',
    },
    {
      title: '강아지가 초콜릿을 먹었어요...',
      content: '잠깐 한눈판 사이에 몽실이가 초코파이를 먹었네요... 위세척 바로 해야 하나요?',
    },
    {
      title: '강아지 배변 훈련 어떻게 해야 하나요?',
      content: '8개월차 강아지 입니다. 배변 훈련을 시키고 싶은데 방법을 알고 싶어요~~',
    },
    {
      title: '고양이와 함께 산책할 수 있을까요?',
      content: '저도 강아지 가진 사람들처럼 우리집 나비랑 산책하고 싶어요 ㅠㅠ',
    },
    {
      title: '산책 할 때 다른 강아지와 맨날 싸워요.',
      content: '애가 평소에는 조용한데, 산책만 나가면 주변 모든 강아지랑 싸우네요 ㅠㅠㅠㅠ',
    },
  ]
}

export const AnswerPool = {
  contents: [
    '정상적인 성장 과정입니다. 걱정하실 필요 없습니다 :)',
    '즉시 진료가 필요합니다. 지금 당장 가까운 병원 방문을 권장합니다.',
    '행동 치료가 필요합니다. 제 프로필의 훈련 센터에 방문하시길 바라바니다.',
    '즉시 수술이 필요합니다. 제 연락처로 연락 부탁드립니다.',
  ]
}